7767517
9 9
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=44 1=6 11=6 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1584
Pooling                  maxpool2d_0              1 1 1 2 0=0 1=3 11=3 12=3 13=0 2=3 3=0 5=1
Convolution              conv_3                   1 1 2 3 0=27 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=10692
Convolution              conv_4                   1 1 3 4 0=16 1=18 11=18 12=1 13=1 14=8 2=1 3=1 4=8 5=1 6=139968
Convolution              conv_5                   1 1 4 5 0=50 1=20 11=20 12=1 13=1 14=9 2=1 3=1 4=9 5=1 6=320000
Pooling                  maxpool2d_1              1 1 5 6 0=0 1=3 11=3 12=3 13=0 2=3 3=0 5=1
Reshape                  view_7                   1 1 6 7 0=-1
InnerProduct             linear_6                 1 1 7 out0 0=10 1=1 2=4500
